In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [3]:
import numpy as np

In [4]:
df = DataFrame({'key1': ['a', 'a', 'b', 'b', 'a'], 'key2': ['one', 'two', 'one' ,'two', 'one'], 'data1': np.random.randn(5), 'data2': np.random.randn(5)})

In [5]:
df

  key1 key2     data1     data2
0    a  one -0.011806 -1.314400
1    a  two  0.790604 -0.274292
2    b  one -0.250531  0.282474
3    b  two  0.595405 -0.468021
4    a  one -1.063605 -1.718924

In [6]:
grouped = df['data1'].groupby(df['key1'])

In [7]:
grouped

In [8]:
grouped.mean()

key1
a   -0.094936
b    0.172437
Name: data1, dtype: float64

In [9]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [10]:
means

key1  key2
a     one    -0.537705
      two     0.790604
b     one    -0.250531
      two     0.595405
Name: data1, dtype: float64

In [11]:
means.unstack()

key2       one       two
key1
a    -0.537705  0.790604
b    -0.250531  0.595405

In [12]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [13]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [14]:
df['data1'].groupby([states, years]).mean()

California  2005    0.790604
            2006   -0.250531
Ohio        2005    0.291799
            2006   -1.063605
Name: data1, dtype: float64

In [15]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.094936 -1.102539
b     0.172437 -0.092773

In [16]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.537705 -1.516662
     two   0.790604 -0.274292
b    one  -0.250531  0.282474
     two   0.595405 -0.468021

In [17]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [18]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.011806 -1.314400
1    a  two  0.790604 -0.274292
4    a  one -1.063605 -1.718924
b
  key1 key2     data1     data2
2    b  one -0.250531  0.282474
3    b  two  0.595405 -0.468021

In [19]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -0.011806 -1.314400
4    a  one -1.063605 -1.718924
('a', 'two')
  key1 key2     data1     data2
1    a  two  0.790604 -0.274292
('b', 'one')
  key1 key2     data1     data2
2    b  one -0.250531  0.282474
('b', 'two')
  key1 key2     data1     data2
3    b  two  0.595405 -0.468021

In [20]:
pieces = dict(list(df.groupby('key1')))

In [21]:
pieces['b']

  key1 key2     data1     data2
2    b  one -0.250531  0.282474
3    b  two  0.595405 -0.468021

In [22]:
List = list(df.groupby('key1'))

In [23]:
List

[('a',
    key1 key2     data1     data2
  0    a  one -0.011806 -1.314400
  1    a  two  0.790604 -0.274292
  4    a  one -1.063605 -1.718924),
 ('b',
    key1 key2     data1     data2
  2    b  one -0.250531  0.282474
  3    b  two  0.595405 -0.468021)]

In [24]:
pieces

{'a':   key1 key2     data1     data2
 0    a  one -0.011806 -1.314400
 1    a  two  0.790604 -0.274292
 4    a  one -1.063605 -1.718924,
 'b':   key1 key2     data1     data2
 2    b  one -0.250531  0.282474
 3    b  two  0.595405 -0.468021}

In [25]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [26]:
grouped

In [27]:
for dtype , group in grouped:
    print(dtype)
    print(group)

a
0   -0.011806
1    0.790604
4   -1.063605
Name: data1, dtype: float64
b
2   -0.250531
3    0.595405
Name: data1, dtype: float64

In [28]:
grouped = df.groupby(df.dtypes, axis=1)

In [29]:
df

  key1 key2     data1     data2
0    a  one -0.011806 -1.314400
1    a  two  0.790604 -0.274292
2    b  one -0.250531  0.282474
3    b  two  0.595405 -0.468021
4    a  one -1.063605 -1.718924

In [30]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one  -1.516662
     two  -0.274292
b    one   0.282474
     two  -0.468021

In [31]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [32]:
s_grouped

In [33]:
s_grouped.mean()

key1  key2
a     one    -1.516662
      two    -0.274292
b     one     0.282474
      two    -0.468021
Name: data2, dtype: float64

In [34]:
people = DataFrame(np.random.randn(5,5), columns=['a', 'b', 'c', 'd', 'e'], index=['Joe', 'Steve', 'Wes', 'Jim','Travis' ])

In [35]:
people
people.iloc[2:3, [1,2]] = np.nan

In [36]:
people

               a         b         c         d         e
Joe     0.493724  1.438740 -1.126257 -1.822531 -1.431974
Steve  -0.141381 -0.854699  1.759302  0.602517 -1.216904
Wes     0.607334       NaN       NaN  0.276340 -1.046268
Jim     0.639657 -0.352739 -0.693214  0.147466 -1.332303
Travis -0.197234 -0.635657  1.669203 -0.906146 -0.107075

In [37]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f':'orange'}

In [38]:
by_column = people.groupby(mapping, axis=1)

In [39]:
by_column.sum()

            blue       red
Joe    -2.948788  0.500490
Steve   2.361819 -2.212984
Wes     0.276340 -0.438933
Jim    -0.545748 -1.045385
Travis  0.763057 -0.939966

In [40]:
map_series = Series(mapping)

In [41]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [42]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [43]:
people.groupby(len).sum()

          a         b         c         d         e
3  1.740716  1.086001 -1.819471 -1.398725 -3.810544
5 -0.141381 -0.854699  1.759302  0.602517 -1.216904
6 -0.197234 -0.635657  1.669203 -0.906146 -0.107075

In [44]:
key_list=['one', 'one', 'one', 'two', 'two']

In [45]:
people

               a         b         c         d         e
Joe     0.493724  1.438740 -1.126257 -1.822531 -1.431974
Steve  -0.141381 -0.854699  1.759302  0.602517 -1.216904
Wes     0.607334       NaN       NaN  0.276340 -1.046268
Jim     0.639657 -0.352739 -0.693214  0.147466 -1.332303
Travis -0.197234 -0.635657  1.669203 -0.906146 -0.107075

In [46]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  0.493724  1.438740 -1.126257 -1.822531 -1.431974
  two  0.639657 -0.352739 -0.693214  0.147466 -1.332303
5 one -0.141381 -0.854699  1.759302  0.602517 -1.216904
6 two -0.197234 -0.635657  1.669203 -0.906146 -0.107075

In [47]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'], [1,3,5,1,3]], names=['cty', 'tenor'])

In [48]:
hier_df = pd.DataFrame(np.random.randn(4,5), columns=columns)

In [49]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -2.317289 -2.543908 -0.020071  0.164635  2.732915
1      1.357237  1.248444  1.277132 -0.865449  0.920545
2      0.706722  0.012314 -0.882833  2.189904 -1.035742
3     -1.789702  0.854050  0.351481 -0.867314  0.673890

In [50]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [51]:
df

  key1 key2     data1     data2
0    a  one -0.011806 -1.314400
1    a  two  0.790604 -0.274292
2    b  one -0.250531  0.282474
3    b  two  0.595405 -0.468021
4    a  one -1.063605 -1.718924

In [52]:
grouped = df.groupby('key1')

In [54]:
grouped['data1'].quantile(0.5)

key1
a   -0.011806
b    0.172437
Name: data1, dtype: float64

In [55]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [57]:
grouped.agg(peak_to_peak)

/var/folders/tl/3mcdykwx5g145dz_cpc1vdxc0000gn/T/ipykernel_44639/4193407341.py:1: FutureWarning: ['key2'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.854209  1.444632
b     0.845936  0.750495

In [58]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.094936  0.929895 -1.063605 -0.537705 -0.011806  0.389399
b      2.0  0.172437  0.598167 -0.250531 -0.039047  0.172437  0.383921

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.790604   3.0 -1.102539  0.745255 -1.718924 -1.516662 -1.314400
b     0.595405   2.0 -0.092773  0.530680 -0.468021 -0.280397 -0.092773


           75%       max
key1
a    -0.794346 -0.274292
b     0.094851  0.282474

In [59]:
tips = pd.read_csv('examples/tips.csv')

In [61]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [62]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [63]:
grouped = tips.groupby(['day', 'smoker'])

In [64]:
grouped_pct = grouped['tip_pct']

In [65]:
grouped

In [66]:
grouped_pct

In [67]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [68]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [69]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [70]:
functions = ['count', 'mean', 'max']

In [71]:
result = grouped['tip_pct', 'total_bill'].agg(functions)

/var/folders/tl/3mcdykwx5g145dz_cpc1vdxc0000gn/T/ipykernel_44639/1540724723.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  result = grouped['tip_pct', 'total_bill'].agg(functions)

In [72]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [73]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [74]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]

In [75]:
grouped['tip_pct', 'total_bill'].agg(ftuples)

/var/folders/tl/3mcdykwx5g145dz_cpc1vdxc0000gn/T/ipykernel_44639/514018043.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  grouped['tip_pct', 'total_bill'].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [76]:
grouped.agg({'tip': np.max, 'size': 'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [77]:
grouped.agg({'tip_pct':  ['min', 'max', 'mean', 'std'], 'size': 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

In [78]:
tips.groupby(['day', 'smoker'], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [79]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [80]:
top(tips, n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [81]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [83]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [84]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [85]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [86]:
result.unstack('smoker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [88]:
tips.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
88        24.71  5.85     No  Thur   Lunch     2  0.236746
185       20.69  5.00     No   Sun  Dinner     5  0.241663
51        10.29  2.60     No   Sun  Dinner     2  0.252672
149        7.51  2.00     No  Thur   Lunch     2  0.266312
232       11.61  3.39     No   Sat  Dinner     2  0.291990
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [89]:
frame = DataFrame({'data1': np.random.randn(1000), 'data2': np.random.randn(1000)})

In [90]:
quartiles = pd.cut(frame.data1, 4)

In [91]:
quartiles[:10]

0    (-1.615, 0.103]
1      (0.103, 1.82]
2    (-1.615, 0.103]
3      (0.103, 1.82]
4    (-1.615, 0.103]
5      (0.103, 1.82]
6    (-1.615, 0.103]
7      (0.103, 1.82]
8      (0.103, 1.82]
9    (-1.615, 0.103]
Name: data1, dtype: category
Categories (4, interval[float64, right]): [(-3.339, -1.615] < (-1.615, 0.103] < (0.103, 1.82] < (1.82, 3.538]]

In [92]:
frame[:10]

      data1     data2
0  0.014894  0.544357
1  0.905337  2.469024
2 -0.683183 -1.972534
3  0.333252 -1.046325
4 -1.112175  0.498763
5  0.608636 -0.215944
6 -0.191768 -0.747750
7  0.671358 -1.082353
8  0.827661 -0.551082
9 -1.412122 -1.664759

In [93]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(), 'count': group.count(), 'mean': group.mean()}

In [94]:
grouped = frame.data2.groupby(quartiles)

In [95]:
grouped.apply(get_stats).unstack()

                       min       max  count      mean
data1
(-3.339, -1.615] -2.484900  2.194989   50.0 -0.040198
(-1.615, 0.103]  -3.096023  3.307764  489.0 -0.047874
(0.103, 1.82]    -3.464057  2.469024  429.0  0.029720
(1.82, 3.538]    -2.904204  2.043064   32.0  0.130085

In [96]:
grouping = pd.qcut(frame.data1, 10, labels=False)

In [97]:
grouped = frame.data2.groupby(grouping)

In [98]:
grouped.apply(get_stats).unstack()

            min       max  count      mean
data1
0     -2.484900  3.307764  100.0 -0.052495
1     -2.626396  2.491238  100.0 -0.123248
2     -3.096023  2.777425  100.0 -0.045202
3     -2.520157  2.585905  100.0 -0.038447
4     -1.993747  2.278524  100.0  0.066803
5     -2.288160  2.198427  100.0  0.025671
6     -1.714188  2.336819  100.0  0.115669
7     -3.464057  2.253635  100.0 -0.099631
8     -2.014127  2.469024  100.0 -0.062546
9     -2.904204  2.411339  100.0  0.128347

In [99]:
s = Series(np.random.randn(6))

In [100]:
s[::2] = np.nan

In [101]:
s

0         NaN
1    1.166191
2         NaN
3   -0.341578
4         NaN
5    0.398632
dtype: float64

In [102]:
s.fillna(s.mean())

0    0.407748
1    1.166191
2    0.407748
3   -0.341578
4    0.407748
5    0.398632
dtype: float64

In [103]:
states = ['Ohio', 'New York', 'Vermont', 'Florida', 'Oregon', 'Nevada', 'California', 'Idaho']

In [104]:
group_key = ['East'] * 4 + ['West'] * 4

In [105]:
data = Series(np.random.randn(8), index=states)

In [106]:
data

Ohio          0.109104
New York     -0.620928
Vermont       0.778466
Florida       0.168542
Oregon       -0.286919
Nevada        0.089198
California    1.632100
Idaho        -1.117771
dtype: float64

In [107]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan

In [108]:
data

Ohio          0.109104
New York     -0.620928
Vermont            NaN
Florida       0.168542
Oregon       -0.286919
Nevada             NaN
California    1.632100
Idaho              NaN
dtype: float64

In [109]:
data.groupby(group_key).mean()

East   -0.114427
West    0.672590
dtype: float64

In [110]:
fill_mean = lambda g: g.fillna(g.mean())

In [111]:
data.groupby(group_key).apply(fill_mean)

Ohio          0.109104
New York     -0.620928
Vermont      -0.114427
Florida       0.168542
Oregon       -0.286919
Nevada        0.672590
California    1.632100
Idaho         0.672590
dtype: float64

In [112]:
fill_values = {'East': 0.5, 'West': -1}

In [113]:
fill_func = lambda g: g.fillna(fill_values[
g.name
])

In [114]:
data.groupby(group_key).apply(fill_func)

Ohio          0.109104
New York     -0.620928
Vermont       0.500000
Florida       0.168542
Oregon       -0.286919
Nevada       -1.000000
California    1.632100
Idaho        -1.000000
dtype: float64

In [115]:
suits = ['H', 'S', 'C', 'D']

In [116]:
card_val = (list(range(1,11)) + [10] *3) * 4

In [117]:
card_val

[1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 10,
 10,
 10,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 10,
 10,
 10,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 10,
 10,
 10,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 10,
 10,
 10]

In [118]:
base_names = ['A'] + list(range(2,11)) + ['J', 'K', 'Q']

In [119]:
cards = []

In [120]:
for suit in suits:
    cards.extend(str(num) + suit for num in base_names)

In [121]:
deck = Series(card_val, index=cards)

In [122]:
drck

NameError: name 'drck' is not defined

In [123]:
deck

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
AS      1
2S      2
3S      3
4S      4
5S      5
6S      6
7S      7
8S      8
9S      9
10S    10
JS     10
KS     10
QS     10
AC      1
2C      2
3C      3
4C      4
5C      5
6C      6
7C      7
8C      8
9C      9
10C    10
JC     10
KC     10
QC     10
AD      1
2D      2
3D      3
4D      4
5D      5
6D      6
7D      7
8D      8
9D      9
10D    10
JD     10
KD     10
QD     10
dtype: int64

In [124]:
def draw(deck, n=5):
    return deck.sample(n)

In [125]:
draw(deck)

8C     8
5C     5
KD    10
JC    10
KC    10
dtype: int64

In [126]:
deck

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
AS      1
2S      2
3S      3
4S      4
5S      5
6S      6
7S      7
8S      8
9S      9
10S    10
JS     10
KS     10
QS     10
AC      1
2C      2
3C      3
4C      4
5C      5
6C      6
7C      7
8C      8
9C      9
10C    10
JC     10
KC     10
QC     10
AD      1
2D      2
3D      3
4D      4
5D      5
6D      6
7D      7
8D      8
9D      9
10D    10
JD     10
KD     10
QD     10
dtype: int64

In [127]:
get_suit = lambda card: card[-1]

In [128]:
deck.groupby(get_suit).apply(draw, n=2)

C  6C     6
   QC    10
D  JD    10
   6D     6
H  KH    10
   3H     3
S  8S     8
   6S     6
dtype: int64

In [129]:
df = DataFrame({'category': ['a', 'a', 'a', 'a', 'b', 'b', 'b', 'b'], 'data': np.random.randn(8), 'weights': np.random.rand(8)})

In [130]:
df

  category      data   weights
0        a  0.740773  0.148047
1        a -0.230388  0.773603
2        a -0.831900  0.445536
3        a  1.391282  0.079110
4        b  0.340078  0.469397
5        b -1.158561  0.466772
6        b -0.375931  0.899951
7        b -2.202823  0.224697

In [131]:
grouped = df.groupby('category')

In [132]:
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])

In [133]:
grouped.apply(get_wavg)

category
a   -0.227572
b   -0.589300
dtype: float64

In [134]:
close_px = pd.read_csv('examples/stock_px_2.csv', parse_dates = True, index_col=0)

In [135]:
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   AAPL    2214 non-null   float64
 1   MSFT    2214 non-null   float64
 2   XOM     2214 non-null   float64
 3   SPX     2214 non-null   float64
dtypes: float64(4)
memory usage: 86.5 KB

In [136]:
close_px[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [137]:
spx_corr = lambda x: x.corrwith(x['SPX'])

In [138]:
rets = close_px.pct_change().dropna()

In [139]:
get_year = lambda x: x.year

In [140]:
by_year = rets.groupby(get_year)

In [141]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [142]:
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

In [148]:
import statsmodels.api as sm

In [149]:
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1.
    result = sm.OLS(Y, X).fit()
    return result.params

In [150]:
by_year.apply(regress, 'AAPL', ['SPX'])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

In [151]:
tips.pivot_table(index=['day', 'smoker'])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.151650   18.420000
     Yes     2.066667  2.714000  0.174783   16.813333
Sat  No      2.555556  3.102889  0.158048   19.661778
     Yes     2.476190  2.875476  0.147906   21.276667
Sun  No      2.929825  3.167895  0.160113   20.506667
     Yes     2.578947  3.516842  0.187250   24.120000
Thur No      2.488889  2.673778  0.160298   17.113111
     Yes     2.352941  3.030000  0.163863   19.190588

In [152]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'], columns='smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

In [153]:
tips.pivot_table(['tip_pct','size'], index=['time', 'day'], columns='smoker', margins=True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
time   day
Dinner Fri   2.000000  2.222222  2.166667  0.139622  0.165347  0.158916
       Sat   2.555556  2.476190  2.517241  0.158048  0.147906  0.153152
       Sun   2.929825  2.578947  2.842105  0.160113  0.187250  0.166897
       Thur  2.000000       NaN  2.000000  0.159744       NaN  0.159744
Lunch  Fri   3.000000  1.833333  2.000000  0.187735  0.188937  0.188765
       Thur  2.500000  2.352941  2.459016  0.160311  0.163863  0.161301
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803

In [154]:
tips.pivot_table('tip_pct', index=['time', 'smoker'], columns='day', aggfunc=len, margins=True)

day             Fri   Sat   Sun  Thur  All
time   smoker
Dinner No       3.0  45.0  57.0   1.0  106
       Yes      9.0  42.0  19.0   NaN   70
Lunch  No       1.0   NaN   NaN  44.0   45
       Yes      6.0   NaN   NaN  17.0   23
All            19.0  87.0  76.0  62.0  244

In [156]:
tips.pivot_table('tip_pct', index=['time', 'size', 'smoker'], columns='day',  fill_value=0)

day                      Fri       Sat       Sun      Thur
time   size smoker
Dinner 1    No      0.000000  0.137931  0.000000  0.000000
            Yes     0.000000  0.325733  0.000000  0.000000
       2    No      0.139622  0.162705  0.168859  0.159744
            Yes     0.171297  0.148668  0.207893  0.000000
       3    No      0.000000  0.154661  0.152663  0.000000
            Yes     0.000000  0.144995  0.152660  0.000000
       4    No      0.000000  0.150096  0.148143  0.000000
            Yes     0.117750  0.124515  0.193370  0.000000
       5    No      0.000000  0.000000  0.206928  0.000000
            Yes     0.000000  0.106572  0.065660  0.000000
       6    No      0.000000  0.000000  0.103799  0.000000
Lunch  1    No      0.000000  0.000000  0.000000  0.181728
            Yes     0.223776  0.000000  0.000000  0.000000
       2    No      0.000000  0.000000  0.000000  0.166005
            Yes     0.181969  0.000000  0.000000  0.158843
       3    No      0.187735  0.000000  0.000000  0.084246
            Yes     0.000000  0.000000  0.000000  0.204952
       4    No      0.000000  0.000000  0.000000  0.138919
            Yes     0.000000  0.000000  0.000000  0.155410
       5    No      0.000000  0.000000  0.000000  0.121389
       6    No      0.000000  0.000000  0.000000  0.173706

In [157]:
tips.pivot_table('tip_pct', index=['time', 'size', 'smoker'], columns='day', aggfunc='mean',  fill_value=0)

day                      Fri       Sat       Sun      Thur
time   size smoker
Dinner 1    No      0.000000  0.137931  0.000000  0.000000
            Yes     0.000000  0.325733  0.000000  0.000000
       2    No      0.139622  0.162705  0.168859  0.159744
            Yes     0.171297  0.148668  0.207893  0.000000
       3    No      0.000000  0.154661  0.152663  0.000000
            Yes     0.000000  0.144995  0.152660  0.000000
       4    No      0.000000  0.150096  0.148143  0.000000
            Yes     0.117750  0.124515  0.193370  0.000000
       5    No      0.000000  0.000000  0.206928  0.000000
            Yes     0.000000  0.106572  0.065660  0.000000
       6    No      0.000000  0.000000  0.103799  0.000000
Lunch  1    No      0.000000  0.000000  0.000000  0.181728
            Yes     0.223776  0.000000  0.000000  0.000000
       2    No      0.000000  0.000000  0.000000  0.166005
            Yes     0.181969  0.000000  0.000000  0.158843
       3    No      0.187735  0.000000  0.000000  0.084246
            Yes     0.000000  0.000000  0.000000  0.204952
       4    No      0.000000  0.000000  0.000000  0.138919
            Yes     0.000000  0.000000  0.000000  0.155410
       5    No      0.000000  0.000000  0.000000  0.121389
       6    No      0.000000  0.000000  0.000000  0.173706

In [158]:
data

Ohio          0.109104
New York     -0.620928
Vermont            NaN
Florida       0.168542
Oregon       -0.286919
Nevada             NaN
California    1.632100
Idaho              NaN
dtype: float64

In [161]:
data = DataFrame({'Sample': range(1,11), 'Nationality': ['USA', 'Japan','USA', 'Japan', 'Japan', 'Japan', 'USA', 'USA', 'Japan', 'USA'], 'Handedness':['Right-handed', 'Left-handed', 'Right-handed', 'Right-handed', 'Left-handed', 'Right-handed', 'Right-handed', 'Left-handed', 'Right-handed', 'Right-handed']})

In [162]:
data

   Sample Nationality    Handedness
0       1         USA  Right-handed
1       2       Japan   Left-handed
2       3         USA  Right-handed
3       4       Japan  Right-handed
4       5       Japan   Left-handed
5       6       Japan  Right-handed
6       7         USA  Right-handed
7       8         USA   Left-handed
8       9       Japan  Right-handed
9      10         USA  Right-handed

In [163]:
pd.crosstab(data.Nationality, data.Handedness, margins=True)

Handedness   Left-handed  Right-handed  All
Nationality
Japan                  2             3    5
USA                    1             4    5
All                    3             7   10

In [164]:
pd.crosstab([tips.time, tips.day], tips.smoker, margins=True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244